#include "imageview.h"


/******************************************************************************
*   Конструктор
******************************************************************************/
ImageView::ImageView()
    : m_imegeWidget(new OpenGLWidget())
{

}


/******************************************************************************
*   Создание и/или передача виджета представления
******************************************************************************/
QWidget *ImageView::createWidget() const
{
    return m_imegeWidget;
}


/******************************************************************************
*   Обновление представления по событию изменения модели
******************************************************************************/
void ImageView::update(SplitterViewModel *model)
{

}
